# Functions
-There are two types of functions in python
  1.Built-in functions
  2.Used defined functions(UDF)

# User defined functions

In [1]:
def area_of_rectangle(length,breadth):
    area=length * breadth
    return area
    
area_of_rectangle(10,20)

200

In [2]:
def square(a):
    sq=a*a
    return sq

In [3]:
square(10)

100

In [4]:
def add_list(list1,list2):
    list1.extend(list2)
    return list1

add_list([1,2,3,4],[5,6,7,8])

[1, 2, 3, 4, 5, 6, 7, 8]

# Data Frames
-Data Frame is a two dimensional array which stores the data in a tabular format

In [5]:
#scalar objects
a=7

In [6]:
#vector objects, 1D objects
b=[7,5]

In [7]:
#2D objects
c=[[1,2,3,4],[5,6,7,8],[9,10,11,12]]
c[1][1]

6

In [8]:
#3D objects
d=[[[1,2,3],[4,5,6]],
    [[7,8,9],[10,11,12]]]
d[1][0][1]

8

In [9]:
d[0][1][1]

5

In [10]:
import pandas as pd

In [11]:
df = pd.DataFrame(c)

In [12]:
df

   0   1   2   3
0  1   2   3   4
1  5   6   7   8
2  9  10  11  12

# Key Libraries

##  Pandas
     -It is used for handling and manipulating Dataframes(2 D objects)
     -Dataframe is a special kind of data structure which allows you to store data in a tabular format

## Numpy
    -Numerical Python
    -It is used for numerical operationS

##  Matplotlib and Seaborn
    -It is used for data visualization in python
    -Seaborn is built on Matplotlib

##  Scipy
    -Scientific Python
    -It is used for complex statistical operations(inferential statistics)

##  Statsmodel
    -It is used for statistical modelling

##  Sklearn
    -Sci-kit learn
    -It is used for machine learning algorithms

## Deep dive into Pandas

In [13]:
series1=pd.Series([10,20,30,40])
series1

0    10
1    20
2    30
3    40
dtype: int64

In [14]:
series1.loc[1]

20

In [15]:
series2=pd.Series({'a':10,'b':20})
series2

a    10
b    20
dtype: int64

In [16]:
series2.loc['a']

10

In [17]:
series3=pd.Series({1:'Prachi',2:'Vipul',3:'Raghav',4:'Aayush'})
series3

1    Prachi
2     Vipul
3    Raghav
4    Aayush
dtype: object

In [21]:
series3=pd.DataFrame([1,2,3,4],['Prachi','Vipul','Raghav','Joseph'],['roll no'])
series3

        roll no
Prachi        1
Vipul         2
Raghav        3
Joseph        4

In [26]:
df1=pd.DataFrame(['Prachi','Vipul','Raghav','Joseph'],[1,2,3,4],['name'])
df1

     name
1  Prachi
2   Vipul
3  Raghav
4  Joseph

In [24]:
df=pd.DataFrame({'Roll No.':[1,2,3,4],'Name':['Prachi','Vipul','Joseph','Alex']})

In [25]:
df

   Roll No.    Name
0         1  Prachi
1         2   Vipul
2         3  Joseph
3         4    Alex

In [28]:
series4=pd.Series([10,20,10],index=[1,2,3])
series4

1    10
2    20
3    10
dtype: int64